# Taps
tap "adoptopenjdk/openjdk"
tap "andreasgrill/utils"
tap "derailed/k9s"
tap "espanso/espanso"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "jesseduffield/lazynpm"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "qmk/qmk"
tap "quarkusio/tap"
tap "txn2/tap"

# Brews
brew "giflib"
brew "jpeg-xl"
brew "aom"
brew "icu4c@76"
brew "openssl@3"
brew "bat"
brew "btop"
brew "cairo"
brew "cmake"
brew "conan"
brew "d2"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "fd"
brew "leptonica"
brew "libarchive"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "gradle"
brew "htop"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "lazygit"
brew "libgccjit"
brew "librsvg"
brew "luajit"
brew "luarocks"
brew "mongosh"
brew "mvfst"
brew "mysql-client"
brew "ncdu"
brew "neovim"
brew "neovide"
brew "nvm"
brew "pkgconf"
brew "pngpaste"
brew "poppler"
brew "postgresql@15", link: true
brew "postgresql@16"
brew "postgresql@17"
brew "python-setuptools"
brew "python-tk@3.13"
brew "python@3.10"
brew "ripgrep"
brew "scrcpy"
brew "sevenzip"
brew "starship"
brew "step"
brew "telnet"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "uv"
brew "wakatime-cli"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn", link: false
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "andreasgrill/utils/auto-selfcontrol"
brew "derailed/k9s/k9s"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazynpm/lazynpm"
brew "koekeishiya/formulae/skhd"
brew "mongodb/brew/mongodb-database-tools"
brew "planetscale/tap/pscale"
brew "qmk/qmk/qmk"
brew "txn2/tap/txeh"

# Casks
cask "1password-cli"
cask "aerospace"
cask "android-platform-tools"
cask "apidog"
cask "arduino-ide"
cask "bruno"
cask "cold-turkey-blocker"
cask "docker"
cask "firefox@developer-edition"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "ghostty"
cask "iriunwebcam"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kicad"
cask "logi-options+"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mouseless"
cask "obsidian"
cask "rustdesk"
cask "sf-symbols"
cask "skype"
cask "todoist"
cask "vial"
cask "wezterm"
cask "zulu@11"

# VSCode
vscode "4ops.terraform"
vscode "airyshift.spaces-inside-braces"
vscode "alefragnani.project-manager"
vscode "angular.ng-template"
vscode "atlassian.atlascode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "matt-meyers.vscode-dbml"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "s3gf4ult.monokai-vibrant"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
